[
    {
        "en_title": "The new ‘whys’: A pragmatic case for climate optimism",
        "cn_title": "新‘为何’：气候乐观主义的务实案例",
        "coaching_brief": "这篇文章从务实角度论证气候乐观主义，提醒国内企业主：环保不仅是成本，更是战略机遇。在全球绿色转型浪潮中，忽视气候议题可能错失市场先机、降低竞争力。通过重新定义‘为何’行动，企业可挖掘节能减排中的创新潜力，提升品牌价值，实现可持续发展与商业增长的双赢。",
        "socratic_questions": [
            "您的企业当前如何应对气候相关风险与机遇？是否将环保纳入长期战略？",
            "在节能减排方面，您的团队是否具备创新思维？如何激励员工参与绿色实践？",
            "面对日益严格的环保法规和消费者绿色偏好，您的决策流程是否足够敏捷以抓住转型机会？"
        ],
        "action_steps": [
            "立即评估企业碳足迹和环保合规性，制定3年绿色转型路线图，明确减排目标和投资计划。",
            "组建跨部门绿色创新小组，鼓励员工提出节能降耗创意，并设立奖励机制，将环保绩效纳入考核。",
            "主动与供应链伙伴合作，推广绿色采购标准，同时开发低碳产品或服务，利用环保优势进行市场差异化宣传。"
        ],
        "dimension_scores": {
            "战略": 8,
            "团队": 7,
            "创新": 9,
            "决策": 7,
            "执行": 6
        },
        "id": "b8c17e",
        "source": "McKinsey Insights",
        "date": "2026-01-17",
        "title": "新‘为何’：气候乐观主义的务实案例"
    },
    {
        "en_title": "Leaders at All Levels: 7 Strategies to Give Your Team Real Power",
        "cn_title": "全员领导力：赋予团队真实权力的7大策略",
        "coaching_brief": "国内企业主常陷入集权管理，导致团队依赖性强、创新不足。本文强调赋能团队，能提升执行效率、激发创新，适合寻求突破增长瓶颈、打造敏捷组织的中小企业主。通过分散权力，可培养后备人才，增强企业韧性。",
        "socratic_questions": [
            "你的团队在多大程度上能自主决策，而不事事请示你？",
            "如果团队拥有更多权力，你认为会带来哪些具体收益和潜在风险？",
            "回顾过去一年，有哪些案例显示团队因缺乏授权而错失机会或效率低下？"
        ],
        "action_steps": [
            "第一步：识别并授权关键任务，如项目决策权给中层，设定明确边界和问责机制。",
            "第二步：建立定期反馈循环，通过周会或工具跟踪授权效果，及时调整支持资源。",
            "第三步：开展领导力培训，培养团队成员的决策和协作能力，强化文化认同。"
        ],
        "dimension_scores": {
            "战略": 8,
            "团队": 9,
            "创新": 7,
            "决策": 8,
            "执行": 9
        },
        "id": "7ec6c5",
        "source": "MIT Sloan Review",
        "date": "2026-01-17",
        "title": "全员领导力：赋予团队真实权力的7大策略"
    },
    {
        "en_title": "Inside Saks Global’s Bankruptcy and the Future of Luxury Retail",
        "cn_title": "Saks Global破产内幕与奢侈品零售的未来战略启示",
        "coaching_brief": "本文分析Saks Global破产案例，揭示奢侈品零售在数字化、供应链和客户体验方面的挑战。国内企业主可从中学习如何避免过度扩张、优化成本结构，并适应消费升级趋势，提升品牌韧性。",
        "socratic_questions": [
            "您的企业是否在扩张中忽视了现金流和成本控制？",
            "如何平衡线上与线下渠道，以应对消费者行为变化？",
            "在竞争加剧时，您的品牌差异化策略是否足够清晰？"
        ],
        "action_steps": [
            "评估当前业务模式，识别潜在风险点，制定现金流管理计划。",
            "调研目标客户需求，优化线上线下融合体验，提升服务附加值。",
            "定期复盘战略执行效果，调整资源配置，强化团队应变能力。"
        ],
        "dimension_scores": {
            "战略": 6,
            "团队": 5,
            "创新": 7,
            "决策": 4,
            "执行": 5
        },
        "id": "744d22",
        "source": "Wharton Knowledge",
        "date": "2026-01-17",
        "title": "Saks Global破产内幕与奢侈品零售的未来战略启示"
    }
]