[
    {
        "name": "MECE (Mutually Exclusive, Collectively Exhaustive) (相互独立，完全穷尽)",
        "definition": "A principle for organizing information into categories that are mutually exclusive (no overlap) and collectively exhaustive (cover all possibilities). (将信息组织成相互独立（无重叠）且完全穷尽（涵盖所有可能性）的类别的原则。)",
        "how_to_use": "1. Identify the problem or topic. 2. Break it down into distinct categories with no overlap. 3. Ensure all possible aspects are covered. (1. 确定问题或主题。2. 将其分解为互不重叠的类别。3. 确保涵盖所有可能的方面。)",
        "english_template": [
            "The MECE framework helps structure complex problems by dividing them into non-overlapping categories.",
            "When applying MECE, ensure each element belongs to only one category and all possibilities are accounted for.",
            "This approach eliminates redundancy and provides a comprehensive analysis of any situation."
        ],
        "mindmap": "MECE Principle\n├── Mutually Exclusive\n│   ├── No Overlap\n│   ├── Clear Boundaries\n│   └── Distinct Categories\n└── Collectively Exhaustive\n    ├── Cover All Possibilities\n    ├── No Gaps\n    └── Complete Analysis"
    },
    {
        "name": "SCQA (Situation-Complication-Question-Answer)",
        "definition": "SCQA是一种结构化沟通框架，通过情境、冲突、问题、答案四个步骤清晰呈现复杂信息，帮助受众快速理解核心观点。",
        "how_to_use": "1. 描述背景情境(Situation) 2. 指出关键冲突(Complication) 3. 提出核心问题(Question) 4. 给出解决方案(Answer)",
        "english_template": [
            "Given the current market saturation, we need to rethink our product positioning.",
            "However, our main competitor just launched a similar feature at half our price point.",
            "So how can we differentiate ourselves while maintaining profitability?"
        ],
        "mindmap": "SCQA\n├── Situation (当前状况)\n│   └── 客观事实描述\n├── Complication (关键冲突)\n│   └── 问题/挑战/变化\n├── Question (核心问题)\n│   └── 需要解决的疑问\n└── Answer (解决方案)\n    └── 具体行动计划"
    },
    {
        "name": "SWOT Analysis (态势分析法)",
        "definition": "A strategic planning tool used to identify and evaluate the Strengths, Weaknesses, Opportunities, and Threats involved in a project, business, or personal decision. (一种用于识别和评估项目、业务或个人决策中涉及的优势、劣势、机会和威胁的战略规划工具。)",
        "how_to_use": "1. Create a four-quadrant matrix labeled Strengths, Weaknesses, Opportunities, Threats. 2. Brainstorm and list internal factors (Strengths/Weaknesses) and external factors (Opportunities/Threats). 3. Analyze the relationships between quadrants to develop strategic insights. (1. 创建一个标有优势、劣势、机会、威胁的四象限矩阵。2. 头脑风暴并列出内部因素（优势/劣势）和外部因素（机会/威胁）。3. 分析象限之间的关系以制定战略见解。)",
        "english_template": [
            "Our primary strength lies in our established brand reputation, which gives us a competitive edge in customer loyalty.",
            "A key weakness we must address is our reliance on a single supplier, creating vulnerability in our supply chain.",
            "The emerging market trend toward sustainable products presents a significant opportunity for expansion into eco-friendly lines."
        ],
        "mindmap": "SWOT Analysis\n├── Internal Factors\n│   ├── Strengths (Positive attributes within control)\n│   │   ├── Resources\n│   │   ├── Capabilities\n│   │   └── Competitive advantages\n│   └── Weaknesses (Negative attributes within control)\n│       ├── Limitations\n│       ├── Gaps\n│       └── Disadvantages\n└── External Factors\n    ├── Opportunities (Positive external conditions)\n    │   ├── Market trends\n    │   ├── Technological advances\n    │   └── Regulatory changes\n    └── Threats (Negative external conditions)\n        ├── Competition\n        ├── Economic factors\n        └── Barriers to entry"
    },
    {
        "name": "SWOT分析模型",
        "definition": "SWOT分析是一种战略规划工具，用于评估组织、项目或个人在特定情境下的优势、劣势、机会和威胁。它通过内部因素（优势和劣势）与外部因素（机会和威胁）的交叉分析，帮助制定有效的战略决策。",
        "how_to_use": "1. 明确分析对象（如企业、产品、个人职业发展）。2. 分别列出内部优势（S）和劣势（W），以及外部机会（O）和威胁（T）。3. 将内部与外部因素进行匹配，形成SO（利用优势抓住机会）、ST（利用优势规避威胁）、WO（克服劣势把握机会）、WT（减少劣势应对威胁）四种战略组合。4. 基于分析结果制定具体行动计划。",
        "english_template": [
            "Strengths: Internal positive attributes/resources",
            "Weaknesses: Internal limitations or areas for improvement",
            "Opportunities: External favorable conditions or trends",
            "Threats: External challenges or risks"
        ],
        "logic_flow": "内部环境分析（S/W） -> 外部环境分析（O/T） -> 交叉匹配（SO/ST/WO/WT） -> 战略制定"
    },
    {
        "name": "艾森豪威尔矩阵",
        "definition": "艾森豪威尔矩阵是一种时间管理工具，通过将任务按重要性和紧急性分为四个象限，帮助人们优先处理事项并提高效率。",
        "how_to_use": "1. 列出所有任务 2. 评估每个任务的重要性和紧急性 3. 将任务放入对应象限：重要且紧急（立即执行）、重要不紧急（计划执行）、紧急不重要（委托他人）、不紧急不重要（删除或推迟）",
        "english_template": [
            "The Eisenhower Matrix is a time management tool that categorizes tasks based on urgency and importance.",
            "It divides tasks into four quadrants: Do First (urgent and important), Schedule (important but not urgent), Delegate (urgent but not important), and Eliminate (neither urgent nor important).",
            "This method helps prioritize work effectively by focusing on what truly matters."
        ],
        "logic_flow": "List tasks -> Assess urgency/importance -> Categorize into quadrants -> Execute based on priority"
    },
    {
        "name": "OKR (Objectives and Key Results)",
        "definition": "A goal-setting framework that helps organizations define and track objectives and their outcomes. OKR consists of an Objective (a clearly defined goal) and Key Results (measurable outcomes that track achievement of the objective).",
        "how_to_use": "Used in business planning, team alignment, and performance tracking. Common scenarios include quarterly planning sessions, project kickoffs, and organizational strategy development.",
        "english_template": [
            "Our Q3 Objective is to increase market share in the European region.",
            "Key Result 1: Achieve 15% revenue growth in Germany.",
            "Key Result 2: Launch 3 new products in France by September.",
            "Key Result 3: Secure partnerships with 5 major distributors."
        ],
        "logic_flow": "Set Vision -> Define Objectives -> Establish Key Results -> Align Teams -> Execute -> Review Progress -> Reflect & Adjust"
    },
    {
        "name": "Pareto Principle (帕累托法则)",
        "definition": "The Pareto Principle, also known as the 80/20 rule, states that roughly 80% of effects come from 20% of causes. This principle suggests that a minority of inputs, efforts, or causes often lead to a majority of outputs, results, or effects. (帕累托法则，又称80/20法则，指出大约80%的结果来自20%的原因。这一原则表明，少数输入、努力或原因通常会产生大部分输出、结果或影响。)",
        "how_to_use": "Use the Pareto Principle to identify and prioritize the most impactful factors in any situation, such as focusing on the 20% of customers who generate 80% of revenue, or the 20% of tasks that yield 80% of productivity gains. (在任何情境中，运用帕累托法则来识别和优先处理最具影响力的因素，例如关注产生80%收入的20%客户，或完成带来80%生产力提升的20%任务。)",
        "english_template": [
            "Identify the key 20% of inputs that drive 80% of the desired outcomes.",
            "Allocate resources and efforts disproportionately to maximize efficiency and impact.",
            "Regularly review and adjust focus to maintain alignment with the most critical factors."
        ],
        "logic_flow": "识别关键因素 -> 分析贡献比例 -> 优先分配资源 -> 持续优化聚焦"
    },
    {
        "name": "First Principles Thinking (第一性原理思维)",
        "definition": "A problem-solving approach that breaks down complex issues into their most fundamental truths or basic elements, then rebuilds solutions from the ground up rather than relying on analogies or existing assumptions. (一种解决问题的方法，将复杂问题分解为最基本的真理或基本要素，然后从零开始重建解决方案，而不是依赖类比或现有假设。)",
        "how_to_use": "When facing innovation challenges, strategic decisions, or complex problems where conventional thinking leads to incremental improvements rather than breakthroughs. (当面临创新挑战、战略决策或复杂问题时，传统思维只能带来渐进式改进而非突破性解决方案的场景。)",
        "english_template": [
            "Let's identify the fundamental components of this problem by asking 'What do we know to be absolutely true?'",
            "By separating facts from assumptions, we can reconstruct the solution from basic principles rather than industry conventions.",
            "This approach requires us to challenge every premise and rebuild our strategy from the ground up."
        ],
        "logic_flow": "Identify Problem -> Deconstruct into Fundamental Elements -> Verify Basic Truths -> Reconstruct Solution from Verified Principles -> Test Against Original Problem"
    }
]