[
    {
        "name": "MECE (Mutually Exclusive, Collectively Exhaustive) (相互独立，完全穷尽)",
        "definition": "A principle for organizing information into distinct, non-overlapping categories that together cover all possibilities without gaps or overlaps. (一种将信息组织成互不重叠、完全覆盖所有可能性的分类原则，确保无遗漏无重复)",
        "how_to_use": "Apply when structuring problems, brainstorming solutions, or analyzing data to ensure comprehensive and clear categorization. (适用于构建问题框架、头脑风暴解决方案或数据分析时，确保分类全面且清晰)",
        "english_template": [
            "To analyze this issue using MECE, we'll break it down into mutually exclusive categories.",
            "Our framework needs to be collectively exhaustive to cover all possible scenarios.",
            "Let's ensure our categories are MECE to avoid overlap and gaps in our analysis."
        ]
    },
    {
        "name": "SCQA Model (情境-冲突-问题-答案模型)",
        "definition": "A structured communication framework that organizes information into four sequential components: Situation (establishes context), Complication (introduces conflict or challenge), Question (poses the core problem), and Answer (provides the solution). (一种结构化的沟通框架，将信息组织为四个连续部分：情境-建立背景，冲突-引入矛盾或挑战，问题-提出核心问题，答案-提供解决方案)",
        "how_to_use": "Apply in business presentations, reports, or proposals to create logical narratives that guide audiences from context to resolution. Start with Situation to set the scene, then introduce Complication to highlight urgency, formulate Question to focus attention, and conclude with Answer to deliver value. (用于商业演示、报告或提案中，创建引导受众从背景到解决方案的逻辑叙述。从情境开始设定场景，引入冲突强调紧迫性，提出问题聚焦注意力，最后以答案提供价值)",
        "english_template": [
            "Given the current market expansion (Situation), we're facing increased competition from new entrants (Complication). How can we maintain our market leadership? (Question) Our proposed strategy involves three key initiatives... (Answer)",
            "While our sales have grown steadily (Situation), customer retention rates have declined by 15% this quarter (Complication). What's causing this disconnect? (Question) Our analysis reveals two primary factors requiring immediate attention... (Answer)",
            "The team successfully launched the product (Situation), but user adoption remains below projections (Complication). How do we accelerate market penetration? (Question) We recommend implementing a revised marketing campaign focused on... (Answer)"
        ]
    }
]