[
    {
        "name": "MECE Principle / MECE原则",
        "definition": "MECE (Mutually Exclusive, Collectively Exhaustive) is a problem-solving framework that ensures categories or components are distinct without overlap (mutually exclusive) and together cover all possibilities (collectively exhaustive). / MECE（相互独立，完全穷尽）是一种问题解决框架，确保类别或组成部分相互独立不重叠（相互独立），且共同覆盖所有可能性（完全穷尽）。",
        "scenario": "A retail CEO needs to analyze declining sales across 100 stores. Using MECE, the team categorizes causes into: 1) External factors (competition, economy), 2) Internal operations (inventory, staffing), 3) Customer factors (demographics, preferences). Each category is distinct, and together they cover all possible reasons, enabling targeted solutions like competitor analysis, staff training, and customer surveys.",
        "logic_flow": [
            "Identify the problem or scope",
            "Break down into mutually exclusive categories",
            "Ensure categories are collectively exhaustive",
            "Analyze each category systematically",
            "Synthesize findings for decision-making"
        ],
        "english_template": [
            "Let's apply MECE to ensure our analysis covers all angles without overlap.",
            "Our framework is MECE: each factor is distinct, and together they explain the entire situation."
        ],
        "coach_tips": "Common pitfalls: Overlapping categories leading to confusion, or gaps causing missed insights. Expert advice: Start with broad categories and refine iteratively; use tools like logic trees or matrices to visualize MECE structure; validate with stakeholders to ensure comprehensiveness."
    },
    {
        "name": "SCQA Framework / SCQA框架",
        "definition": "A structured communication model that organizes information into four components: Situation, Complication, Question, and Answer. It helps business leaders present ideas clearly and persuasively by establishing context, identifying problems, framing key questions, and providing solutions. / 一种结构化沟通模型，将信息组织为四个组成部分：情境、冲突、问题和答案。它通过建立背景、识别问题、构建关键问题和提供解决方案，帮助商业领袖清晰且有说服力地呈现想法。",
        "scenario": "A technology company CEO needs to present a new product strategy to the board. Using SCQA: Situation (Our market share has remained stagnant at 15% for three years), Complication (Competitors have launched AI-powered features attracting our premium customers), Question (How can we differentiate our product to regain market leadership?), Answer (We propose developing an integrated ecosystem with predictive analytics and personalized automation).",
        "logic_flow": [
            "Situation: Establish the current context or background",
            "Complication: Identify the problem, challenge, or disruption",
            "Question: Frame the core issue or decision needed",
            "Answer: Present the solution, recommendation, or action plan"
        ],
        "english_template": [
            "Meeting phrase: 'To frame our discussion, let me start with the current situation...'",
            "Presentation phrase: 'The complication we face is... which leads us to the critical question:... Our answer is...'"
        ],
        "coach_tips": "Common pitfalls: Rushing through Situation (causing confusion), overcomplicating Complication (losing focus), asking vague Questions (weakening impact), or presenting weak Answers (lacking evidence). Expert advice: Spend adequate time on Situation for shared understanding, make Complication specific and data-driven, ensure Question directly addresses the core issue, and support Answer with concrete examples and measurable outcomes. Practice the flow backward from Answer to ensure logical coherence."
    },
    {
        "name": "Pareto Principle / 帕累托法则",
        "definition": "The Pareto Principle, also known as the 80/20 rule, states that roughly 80% of effects come from 20% of causes. In business contexts, this often means 80% of results (revenue, problems, etc.) stem from 20% of inputs (clients, efforts, factors). / 帕累托法则，又称80/20法则，指出大约80%的结果来自20%的原因。在商业环境中，这通常意味着80%的成果（收入、问题等）源于20%的投入（客户、努力、因素）。",
        "scenario": "A software company finds that 80% of its revenue comes from just 20% of its enterprise clients, while the remaining 80% of smaller clients contribute only 20% of revenue. By applying the Pareto Principle, the leadership team decides to reallocate resources: they assign their top account managers to nurture key enterprise relationships, streamline support for smaller clients through automated systems, and develop targeted upselling strategies for the high-value segment. This leads to a 15% revenue increase within six months without proportional cost growth.",
        "logic_flow": [
            "Identify key metrics (e.g., revenue, customer complaints, productivity)",
            "Analyze data to determine the 20% of inputs driving 80% of outcomes",
            "Prioritize resources and efforts on high-impact areas",
            "Monitor and adjust based on results"
        ],
        "english_template": [
            "In our quarterly review, we observed that 80% of our sales come from just 20% of our product lines—let's focus our R&D there.",
            "The data shows that 20% of our processes cause 80% of delays; streamlining these will maximize efficiency."
        ],
        "coach_tips": "Common pitfalls: Misapplying the 80/20 ratio as a rigid rule (it's a heuristic, not exact), neglecting the 'trivial many' entirely (which can cause long-term issues), or over-focusing on past data without considering future trends. Expert advice: Use the principle dynamically—regularly re-evaluate what constitutes the 'vital few,' balance short-term gains with sustainable growth, and combine it with other frameworks like the Eisenhower Matrix for task prioritization."
    },
    {
        "name": "First Principles Thinking / 第一性原理思维",
        "definition": "First Principles Thinking is a problem-solving approach that breaks down complex problems into their most fundamental truths or basic elements, then reconstructs solutions from the ground up rather than relying on analogies or existing assumptions. / 第一性原理思维是一种解决问题的方法，它将复杂问题分解为最基本的真理或基本元素，然后从零开始重建解决方案，而不是依赖类比或现有假设。",
        "scenario": "A CEO of an electric vehicle company faces industry skepticism about battery costs being too high to compete with gasoline vehicles. Instead of accepting the prevailing industry cost structure, the CEO applies First Principles Thinking: 1) Breaks down battery costs to raw materials (lithium, cobalt, nickel, etc.) 2) Analyzes commodity market prices versus current battery prices 3) Realizes manufacturing and supply chain inefficiencies create the cost gap 4) Develops vertical integration strategy and new battery chemistry to reduce costs by 60%, enabling competitive pricing.",
        "logic_flow": [
            "Identify and question existing assumptions about the problem",
            "Deconstruct the problem into fundamental components or truths",
            "Reconstruct a new solution from these basic elements"
        ],
        "english_template": [
            "\"Let's step back and question our fundamental assumptions about this market constraint.\"",
            "\"If we rebuild this process from first principles, what would the optimal solution look like?\""
        ],
        "coach_tips": "Common pitfalls: 1) Confusing first principles with intuition or gut feelings 2) Getting stuck in analysis paralysis during deconstruction 3) Failing to communicate the unconventional approach to stakeholders. Expert advice: Start with 'why' questions to uncover assumptions, use the '5 Whys' technique for deeper deconstruction, and create visual models to map fundamental components before reconstruction."
    }
]